---
kind: property
id: P:Autodesk.Revit.DB.Structure.LoadBase.IsConstrainedOnHost
source: html/355eed18-c9de-4a00-29fa-82ca04462a6a.htm
---
# Autodesk.Revit.DB.Structure.LoadBase.IsConstrainedOnHost Property

The load is constrained to host or not.

## Syntax (C#)
```csharp
public bool IsConstrainedOnHost { get; }
```